#### BuiltInFailures.HvacFailures Members

---

|  |
| --- |
| BuiltInFailures HvacFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures HvacFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | PanelDoesntMatchCircuitPropertiesDisconnected | The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit? |

# See Also

BuiltInFailures HvacFailures Class

Autodesk.Revit.DB Namespace